system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

radius 0.5;
halfAngle 45.0;
diagRad #eval{ $radius*sin(degToRad($halfAngle)) };
minDiagRad #eval{ -1*$diagRad };

y               0.5;
minY            #eval{ -1*$y };
z               0.5;
minZ            #eval{ -1*$z };

vertices
(
    (0 0 $z)
    (0 $y 0)
    (0 0 $minZ)
    (0 $minY 0)

    (40 0 $z)
    (40 $y 0)
    (40 0 $minZ)
    (40 $minY 0)
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (20 20 100) simpleGrading (1 1 1)
);

edges
(
    arc 0 1 (0 $diagRad $diagRad)
    arc 1 2 (0 $diagRad $minDiagRad)
    arc 2 3 (0 $minDiagRad $minDiagRad)
    arc 3 0 (0 $minDiagRad $diagRad)

    arc 5 4 (40 $diagRad $diagRad)
    arc 6 5 (40 $diagRad $minDiagRad)
    arc 7 6 (40 $minDiagRad $minDiagRad)
    arc 4 7 (40 $minDiagRad $diagRad)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (3 2 1 0)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (2 6 5 1)
            (3 7 6 2)
            (0 4 7 3)
        );
    }
);


// ************************************************************************* //
